#+OPTIONS: toc:nil

* Amicable numbers

** Task

Let d(n) be defined as the sum of proper divisors of n (numbers less than n
which divide evenly into n).

If d(a) = b and d(b) = a, where a ≠ b, then a and b are an amicable pair and
each of a and b are called amicable numbers.

For example, the proper divisors of 220 are 1, 2, 4, 5, 10, 11, 20, 22, 44, 55
and 110; therefore d(220) = 284. The proper divisors of 284 are 1, 2, 4, 71 and
142; so d(284) = 220.

Evaluate the sum of all the amicable numbers under 10000.

** Solution

#+BEGIN_SRC python :results output :exports both
import math

def d(n):
    total = 0
    for i in range(1, math.floor(math.sqrt(n)) + 1):
        if n % i == 0:
            if i * i != n and i != 1:
                total += i + int(n / i)
            else:
                total += i
    return total

def is_amicable_number(n):
    if d(d(n)) == n and d(n) != n:
        return True
    return False

total = 0
for i in range(1, 10000):
    if is_amicable_number(i):
        total += i

print(total)
#+END_SRC

#+RESULTS:
: 31626
